# Pandas

In [1]:
import pandas as pd
import numpy as np

## Series: Collection of labelled data

In [2]:
s1=pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s2=pd.Series([10,20,30,40],index=['A','B','C','D'])
s2

A    10
B    20
C    30
D    40
dtype: int64

## Different ways to create series

In [4]:
s1=pd.Series(np.random.randint(1,50,5))
s1

0     4
1    25
2    38
3    14
4    13
dtype: int32

In [5]:
s1.index=['A','B','C','D','E']
s1

A     4
B    25
C    38
D    14
E    13
dtype: int32

In [6]:
s1['A']

np.int32(4)

In [7]:
toppers=pd.Series({'IT':78,'Mech':77,'Civil':80})
toppers

IT       78
Mech     77
Civil    80
dtype: int64

## Operations on series

In [8]:
s1=pd.Series([10,20,30,40])
s2=pd.Series([1,2,3,4])
s1+s2

0    11
1    22
2    33
3    44
dtype: int64

In [9]:
# Labelwise opeartions
s1=pd.Series([10,20,30,40],index=['A','B','C','D'])
s2=pd.Series([1,2,3,4],index=['C','D','G','H'])
s1+s2

A     NaN
B     NaN
C    31.0
D    42.0
G     NaN
H     NaN
dtype: float64

In [10]:
s2

C    1
D    2
G    3
H    4
dtype: int64

In [11]:
s2[s2%2==0]  # Conditional selection

D    2
H    4
dtype: int64

# DataFrame

In [12]:
arr1=np.arange(2,41,2).reshape(4,5)
df=pd.DataFrame(arr1)
df.columns=['C1','C2','C3','C4','C5']
df

   C1  C2  C3  C4  C5
0   2   4   6   8  10
1  12  14  16  18  20
2  22  24  26  28  30
3  32  34  36  38  40

In [13]:
# DataFrame using List
students=pd.DataFrame([[1,'Ajinkya',56,'M'],
                       [2,'Sahil',60,'M'],
                       [3,'Tanvi',55,'F']],
            columns=['RollNo','Name','Marks','Gender'])
students

   RollNo     Name  Marks Gender
0       1  Ajinkya     56      M
1       2    Sahil     60      M
2       3    Tanvi     55      F

In [14]:
# DataFrame using Dictionary
emp=pd.DataFrame({'Eid':[101,102,103,104],
                  'name':['Shhubham','Prachi','Jai','Vaibhav'],
                 'Salary':[23000,40000,27000,34000]})
emp

   Eid      name  Salary
0  101  Shhubham   23000
1  102    Prachi   40000
2  103       Jai   27000
3  104   Vaibhav   34000

## Adding columns and rows to DataFrame

In [80]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000     NaN      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

In [16]:
emp['Address']=['Pune','Mumbai','Pune','Nashik']
emp['Gender']=['M','F','M','M']
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M

In [17]:
# Inserting rows into Data
emp.loc[4]=[105,'Ganesh',24000,'Nagpur','M']

In [18]:
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M
4  105    Ganesh   24000  Nagpur      M

## Note: Series and DataFrame works on columns

In [19]:
emp.shape

(5, 5)

In [20]:
emp.ndim

2

## when we don't know how many rows are in DataFrame and we want to add new row

In [21]:
emp.loc[emp.shape[0]]=[106,'Tanvi',23000,'Nashik','F']

In [22]:
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M
4  105    Ganesh   24000  Nagpur      M
5  106     Tanvi   23000  Nashik      F

In [23]:
students

   RollNo     Name  Marks Gender
0       1  Ajinkya     56      M
1       2    Sahil     60      M
2       3    Tanvi     55      F

In [24]:
# To delete column from DataFrame
students.drop('Gender',axis=1,inplace=True)

In [25]:
students

   RollNo     Name  Marks
0       1  Ajinkya     56
1       2    Sahil     60
2       3    Tanvi     55

In [26]:
#To delete row from DataFrame
students.drop(1,inplace=True)

In [27]:
students

   RollNo     Name  Marks
0       1  Ajinkya     56
2       3    Tanvi     55

In [28]:
details=pd.DataFrame({'Intake':[120,60,120,60],
                     'Admitted':[118,50,100,55]},
                    index=['Mech','Civil','Comp','E&TC'])
details

       Intake  Admitted
Mech      120       118
Civil      60        50
Comp      120       100
E&TC       60        55

## Adding/Removing columns or rows

In [29]:
# details['Vacant']=[2,10,20,5]

In [30]:
details['Vacant']=details['Intake']-details['Admitted']

In [31]:
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Comp      120       100      20
E&TC       60        55       5

In [32]:
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M
4  105    Ganesh   24000  Nagpur      M
5  106     Tanvi   23000  Nashik      F

In [33]:
emp['Address']

0      Pune
1    Mumbai
2      Pune
3    Nashik
4    Nagpur
5    Nashik
Name: Address, dtype: object

In [34]:
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M
4  105    Ganesh   24000  Nagpur      M
5  106     Tanvi   23000  Nashik      F

In [35]:
emp.loc[emp.shape[0]]=[107,'Saksham',34000,'Mumbai','M']

In [36]:
emp

   Eid      name  Salary Address Gender
0  101  Shhubham   23000    Pune      M
1  102    Prachi   40000  Mumbai      F
2  103       Jai   27000    Pune      M
3  104   Vaibhav   34000  Nashik      M
4  105    Ganesh   24000  Nagpur      M
5  106     Tanvi   23000  Nashik      F
6  107   Saksham   34000  Mumbai      M

In [37]:
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Comp      120       100      20
E&TC       60        55       5

In [38]:
students

   RollNo     Name  Marks
0       1  Ajinkya     56
2       3    Tanvi     55

In [39]:
students=pd.DataFrame([[1,'Ajinkya',56,'M'],
                       [2,'Sahil',60,'M'],
                       [3,'Tanvi',55,'F']],
            columns=['RollNo','Name','Marks','Gender'])
students

   RollNo     Name  Marks Gender
0       1  Ajinkya     56      M
1       2    Sahil     60      M
2       3    Tanvi     55      F

In [40]:
students=students.drop('Gender',axis=1)

In [41]:
students

   RollNo     Name  Marks
0       1  Ajinkya     56
1       2    Sahil     60
2       3    Tanvi     55

In [42]:
students.drop('Marks',axis=1,inplace=True)

In [43]:
students

   RollNo     Name
0       1  Ajinkya
1       2    Sahil
2       3    Tanvi

In [44]:
students.drop(1,inplace=True)

In [45]:
students

   RollNo     Name
0       1  Ajinkya
2       3    Tanvi

In [46]:
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Comp      120       100      20
E&TC       60        55       5

In [47]:
details.drop(['Civil','E&TC'])

      Intake  Admitted  Vacant
Mech     120       118       2
Comp     120       100      20

## iloc is used to fetch data from DataFrame when default index is given.
## loc is used to fetch data from DataFrame when default index is not given

In [54]:
emp['dno']=[1,2,3,2,1,2,1]

In [55]:
emp

   Eid      name  Salary Address Gender  dno
0  101  Shhubham   23000    Pune      M    1
1  102    Prachi   40000  Mumbai      F    2
2  103       Jai   27000    Pune      M    3
3  104   Vaibhav   34000  Nashik      M    2
4  105    Ganesh   24000  Nagpur      M    1
5  106     Tanvi   23000  Nashik      F    2
6  107   Saksham   34000  Mumbai      M    1

In [ ]:
emp

In [ ]:
emp.loc[emp['Address']=='Nagpur','dno']=np.nan

In [ ]:
emp

In [ ]:
df1=pd.DataFrame(np.arange(1,11).reshape(2,5))
df2=pd.DataFrame(np.arange(21,31).reshape(2,5))

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1+df2

## concat()

In [ ]:
df1.columns=['A','B','C','D','E']
df2.columns=['C','D','E','F','G']

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2])

In [ ]:
df1+df2

In [ ]:
emp

In [50]:
dept=pd.DataFrame({'dno':[1,2,3,4],
                  'name':['IT','Admin','HR','SCM'],
                  'location':['pune','mumbai','pune','mumbai']})

In [51]:
dept

   dno   name location
0    1     IT     pune
1    2  Admin   mumbai
2    3     HR     pune
3    4    SCM   mumbai

In [ ]:
pd.concat([df1,df2],axis=1)

In [ ]:
emp

In [ ]:
dept

In [ ]:
pd.concat([emp,dept],axis=1)

## merge()

In [ ]:
pd.merge(emp,dept,on='dno',how='inner')

In [ ]:
left_outer=pd.merge(emp,dept,on='dno',how='left')
left_outer

In [ ]:
left_outer[['name_x','name_y','location']]

In [ ]:
left_outer

In [ ]:
emp

In [56]:
new_row=pd.DataFrame([[108,'Pranoti',30000,'Pune','F',2]],
                    columns=emp.columns)
emp=pd.concat([emp,new_row])
emp.reset_index(inplace=True)
emp.drop('index',axis=1,inplace=True)

In [57]:
emp

   Eid      name  Salary Address Gender  dno
0  101  Shhubham   23000    Pune      M    1
1  102    Prachi   40000  Mumbai      F    2
2  103       Jai   27000    Pune      M    3
3  104   Vaibhav   34000  Nashik      M    2
4  105    Ganesh   24000  Nagpur      M    1
5  106     Tanvi   23000  Nashik      F    2
6  107   Saksham   34000  Mumbai      M    1
7  108   Pranoti   30000    Pune      F    2

In [ ]:
emp

In [ ]:
dept

In [58]:
new_row=pd.DataFrame([[109,'Sahil',30000,'Pune','F',2]],
                    columns=emp.columns,
                    index=[emp.shape[0]])
new_row

   Eid   name  Salary Address Gender  dno
8  109  Sahil   30000    Pune      F    2

In [59]:
emp

   Eid      name  Salary Address Gender  dno
0  101  Shhubham   23000    Pune      M    1
1  102    Prachi   40000  Mumbai      F    2
2  103       Jai   27000    Pune      M    3
3  104   Vaibhav   34000  Nashik      M    2
4  105    Ganesh   24000  Nagpur      M    1
5  106     Tanvi   23000  Nashik      F    2
6  107   Saksham   34000  Mumbai      M    1
7  108   Pranoti   30000    Pune      F    2

In [ ]:
# emp['Salary'].max()
# emp['Salary'].min()
# emp['Salary'].sum()
# emp['Salary'].mean()
emp['Salary'].count()

In [ ]:
result=emp['Address'].mode()
result

In [ ]:
emp

In [ ]:
emp.loc[emp['Address']=='Nashik','Address']='Nagar'

In [ ]:
emp

## groupby()

In [ ]:
emp

In [ ]:
emp.groupby('Gender')['Gender'].count()

In [ ]:
emp.groupby('Gender')['Salary'].max()

In [ ]:
emp.groupby('dno')['Salary'].mean()

## unique()

In [ ]:
emp['Address'].unique()

In [ ]:
emp['dno'].unique()

In [ ]:
emp['Address'].nunique()

In [ ]:
# Find out no. of emps in each address
emp.groupby('Address')['Address'].count()

## value_counts()

In [ ]:
emp['Address'].value_counts()

In [ ]:
emp['dno'].value_counts()

In [ ]:
emp['dno'].value_counts()[2]

In [ ]:
emp['Address'].value_counts()

In [ ]:
# Find out address with highest no of emps
emp['Address'].value_counts().index[0]

In [60]:
emp

   Eid      name  Salary Address Gender  dno
0  101  Shhubham   23000    Pune      M    1
1  102    Prachi   40000  Mumbai      F    2
2  103       Jai   27000    Pune      M    3
3  104   Vaibhav   34000  Nashik      M    2
4  105    Ganesh   24000  Nagpur      M    1
5  106     Tanvi   23000  Nashik      F    2
6  107   Saksham   34000  Mumbai      M    1
7  108   Pranoti   30000    Pune      F    2

In [61]:
emp['BG']=['A+','AB+','O-',np.nan,np.nan,np.nan,np.nan,np.nan]

In [62]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000  Mumbai      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

## Handling Missing Values

In [63]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000  Mumbai      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

In [66]:
emp.loc[emp['name']=='Prachi','Address']=np.nan

In [67]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000     NaN      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

## isna()

In [68]:
emp.isna() # It will find whether a column contains null value or not

     Eid   name  Salary  Address  Gender    dno     BG
0  False  False   False    False   False  False  False
1  False  False   False     True   False  False  False
2  False  False   False    False   False  False  False
3  False  False   False    False   False  False   True
4  False  False   False    False   False  False   True
5  False  False   False    False   False  False   True
6  False  False   False    False   False  False   True
7  False  False   False    False   False  False   True

In [69]:
emp.isna().sum() # It will give how many no of null values in column

Eid        0
name       0
Salary     0
Address    1
Gender     0
dno        0
BG         5
dtype: int64

In [70]:
emp1=emp.dropna() # dropna() deletes row of null value

In [71]:
emp1

   Eid      name  Salary Address Gender  dno  BG
0  101  Shhubham   23000    Pune      M    1  A+
2  103       Jai   27000    Pune      M    3  O-

In [73]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000     NaN      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

In [74]:
emp2=emp.drop('Address',axis=1) # It will drop column

In [75]:
emp2

   Eid      name  Salary Gender  dno   BG
0  101  Shhubham   23000      M    1   A+
1  102    Prachi   40000      F    2  AB+
2  103       Jai   27000      M    3   O-
3  104   Vaibhav   34000      M    2  NaN
4  105    Ganesh   24000      M    1  NaN
5  106     Tanvi   23000      F    2  NaN
6  107   Saksham   34000      M    1  NaN
7  108   Pranoti   30000      F    2  NaN

In [76]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000     NaN      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN

In [77]:
avg_sal=emp[emp['dno']==2]['Salary'].mean()

In [78]:
emp['Salary']=emp['Salary'].fillna(avg_sal)

In [79]:
emp

   Eid      name  Salary Address Gender  dno   BG
0  101  Shhubham   23000    Pune      M    1   A+
1  102    Prachi   40000     NaN      F    2  AB+
2  103       Jai   27000    Pune      M    3   O-
3  104   Vaibhav   34000  Nashik      M    2  NaN
4  105    Ganesh   24000  Nagpur      M    1  NaN
5  106     Tanvi   23000  Nashik      F    2  NaN
6  107   Saksham   34000  Mumbai      M    1  NaN
7  108   Pranoti   30000    Pune      F    2  NaN